Documents/упОперацияСистемыПлатон.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упОперацияСистемыПлатон</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.упОперацииСистемыПлатон</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДвижения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДвижения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолготаВьезда</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолготаСъезда</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерБортовогоУстройства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расстояние</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Расстояние</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Трасса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиротаВьезда</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиротаСъезда</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/упОперацияСистемыПлатон/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий	

Процедура ПриКопировании(ОбъектКопирования)
	Автор = Пользователи.ТекущийПользователь();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	РеквизитыОбъекта = Новый Структура();
	РеквизитыОбъекта.Вставить("Период",					Дата);
	РеквизитыОбъекта.Вставить("ДатаНачалаДвижения",		ДатаНачалаДвижения);
	РеквизитыОбъекта.Вставить("ДатаОкончанияДвижения", 	ДатаОкончанияДвижения);
	РеквизитыОбъекта.Вставить("ДолготаВьезда", 			ДолготаВьезда);
	РеквизитыОбъекта.Вставить("ДолготаСъезда", 			ДолготаСъезда);
	РеквизитыОбъекта.Вставить("НаименованиеОперации", 	НаименованиеОперации);
	РеквизитыОбъекта.Вставить("НомерБортовогоУстройства", НомерБортовогоУстройства);
	РеквизитыОбъекта.Вставить("Расстояние", 			Расстояние);
	РеквизитыОбъекта.Вставить("ТранспортноеСредство", 	ТранспортноеСредство);
	РеквизитыОбъекта.Вставить("Трасса", 				Трасса);
	РеквизитыОбъекта.Вставить("УникальныйНомер", 		УникальныйНомер);
	РеквизитыОбъекта.Вставить("ШиротаВьезда", 			ШиротаВьезда);
	РеквизитыОбъекта.Вставить("ШиротаСъезда", 			ШиротаСъезда);
				
	// Формируются расходы
	упОперацияСистемыПлатон.СформироватьДвиженияОперацииСистемыПлатон(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);	

КонецПроцедуры

#КонецОбласти

#КонецЕсли
